{
  "skills": [
    "Analyse des besoins",
    "Découpage de projets",
    "Intégration du site web",
    "Tests automatisés",
    "Analyse des performances",
    "Amélioration de l’accessibilité",
    "Rigoureuse",
    "Travail en équipe"
  ],
  "projects": [
    {
      "id": 1,
      "name": "Kasa - Projet OC",
      "maquettes": "./assets/images/projects/maquette-kasa.png",
      "livrables": "https://github.com/Cecilia-Giusti/Kasa/tree/develop",
      "img": "./assets/images/projects/kasa.jpeg",
      "url": "https://cecilia-giusti.github.io/Kasa",
      "description": "Kasa est une entreprise reconnue en France pour son rôle de leader dans la location d'appartements entre particuliers. Avec son expertise et son expérience, elle offre une solution pratique et économique pour les propriétaires et les locataires en quête de logements de qualité. Kasa se distingue par son approche personnalisée et sa connaissance approfondie du marché immobilier français, ce qui lui permet de répondre efficacement aux besoins de chacun. Que vous soyez un propriétaire souhaitant louer votre bien immobilier ou un locataire cherchant un logement confortable et abordable, Kasa est la référence incontournable pour la location d'appartements entre particuliers en France.",
      "stack": ["React", "CSS"],
      "specifications": "Le projet Kasa, développé en utilisant la technologie React, devait respecter des spécifications et des contraintes strictes afin de répondre aux besoins de ses utilisateurs. Les composants React ont été soigneusement sélectionnés et intégrés pour offrir une expérience utilisateur optimale. Le React router a été utilisé pour gérer la navigation de manière fluide et efficace. De plus, les maquettes ont été suivies de manière rigoureuse pour s'assurer que l'interface graphique était cohérente et facile à utiliser.La conception de l'application a également été pensée pour être responsive, c'est-à-dire qu'elle s'adapte à tous les types d'écrans et de périphériques, afin d'offrir une expérience utilisateur optimale, peu importe le contexte. Aucune librairie externe n'a été utilisée afin de garantir une stabilité et une sécurité maximales de l'application. Le découpage par composant modulaire a été adopté pour faciliter la maintenance et l'évolutivité du code. Chaque fonctionnalité a été divisée en composants indépendants, ce qui permet de les réutiliser facilement dans d'autres parties de l'application. Enfin, une page 404 a été intégrée pour offrir une expérience utilisateur optimale, même en cas d'erreur ou de page manquante. En somme, le projet Kasa a été développé en suivant scrupuleusement toutes les spécifications et contraintes imposées pour offrir une expérience utilisateur optimale, stable et sécurisée."
    },
    {
      "id": 2,
      "name": "OhmyFood - Projet OC",
      "maquettes": "./assets/images/projects/maquette-ohmyfood.png",
      "livrables": "https://github.com/Cecilia-Giusti/Oh-my-food",
      "img": "./assets/images/projects/ohmyfood.jpg",
      "url": "https://cecilia-giusti.github.io/Oh-my-food/",
      "description": "Ohmyfood, une startup établie à New York, cherche à conquérir Paris. Et pour ce faire, ils ont décidé de lancer un site mobile innovant qui permettra aux clients de découvrir les restaurants partenaires et de commander leur repas en avance. Cette idée novatrice permettra aux clients de gagner du temps en évitant les files d'attente interminables et de profiter d'un service rapide et efficace. Le site mobile sera conçu de manière à offrir une expérience utilisateur optimale. Les clients pourront facilement parcourir les différents restaurants partenaires et découvrir leur menu. Ils pourront également filtrer les options en fonction de leur goût ou de leur régime alimentaire. Une fois leur choix fait, les clients pourront passer commande en quelques clics. Le processus de commande sera simple et rapide, permettant aux clients de gagner du temps et de planifier leur repas en toute tranquillité. ",
      "stack": ["HTML", "SASS"],
      "specifications": "Les spécifications techniques de cette phase incluaient l'utilisation de Sass pour la feuille de style, une animation CSS, la prise en compte de la charte graphique pour la mise en page, un design de loading spinner, ainsi que la validation W3C pour assurer la qualité du code.En termes d'expérience utilisateur, le site devait être conçu en utilisant une approche mobile-first et être adapté pour les appareils mobiles, les tablettes et les ordinateurs. Les utilisateurs devaient pouvoir survoler les filtres pour avoir un aperçu rapide des options disponibles. Enfin, l'équipe de développement devait s'assurer que le site soit rapide et fiable pour répondre aux besoins des clients pressés. Le respect des délais de livraison et des attentes des clients était un aspect clé du projet. La phase 2 du projet Ohmyfood consistait à ajouter de nouvelles fonctionnalités, telles que la réservation en ligne et la composition de menus personnalisés. Ces nouvelles fonctionnalités devaient être développées en respectant les mêmes spécifications et contraintes que la phase 1, tout en ajoutant de nouvelles exigences techniques pour répondre aux besoins des clients."
    },
    {
      "id": 3,
      "livrables": "https://github.com/Cecilia-Giusti/P-14-wealth-health",
      "maquettes": "./assets/images/projects/maquette-wealth-health.png",
      "name": "Wealth-Health - Projet OC",
      "img": "./assets/images/projects/wealth-health.webp",
      "url": "https://cecilia-giusti.github.io/P-14-wealth-health/",
      "description": "Wealth Health est une grande société financière qui utilise une application web interne appelée HRnet pour gérer les dossiers de ses employés. Cependant, cette application est ancienne et utilise jQuery côté front end, ce qui entraîne des problèmes techniques et des plaintes de la part des utilisateurs en interne. Pour remédier à cette situation, l'équipe de développement travaille activement sur la mise à niveau de l'application depuis un certain temps. Cette mise à niveau est essentielle pour améliorer l'expérience utilisateur et garantir un fonctionnement optimal de l'application dans le cadre des activités de Wealth Health.",
      "stack": ["React", "TypeScript", "SASS"],
      "specifications": "Le projet WealthHealth consiste en la mise à niveau de l'application web interne HRnet utilisée pour gérer les dossiers des employés de l'entreprise. Pour ce faire, plusieurs spécifications et contraintes ont été définies. Tout d'abord, le projet implique la conversion de l'application existante en utilisant React et TypeScript pour créer deux nouvelles pages : Create employee et Employee list. En outre, le projet nécessite l'ajout d'un système de gestion d'état, en l'occurrence Redux, pour garantir une meilleure gestion des données et une expérience utilisateur améliorée. Le design de l'application sera également changé selon les préférences de l'équipe de développement. Le projet implique également la mise en place de tests unitaires et d'intégration pour garantir un fonctionnement optimal de l'application. Les plugins utilisés dans l'application actuelle seront convertis en utilisant des bibliothèques externes, tandis qu'une bibliothèque externe sera créée pour assurer une meilleure maintenance et évolutivité de l'application. Enfin, un audit de performance sera réalisé en utilisant Lighthouse pour s'assurer que l'application répond aux normes de performance requises. Dans l'ensemble, le projet WealthHealth vise à améliorer l'expérience utilisateur de l'application HRnet tout en garantissant un fonctionnement optimal et une maintenance facile."
    },
    {
      "id": 4,
      "livrables": "https://github.com/Cecilia-Giusti/Booki",
      "maquettes": "./assets/images/projects/maquette-booki.png",
      "name": "Booki - Projet OC",
      "img": "./assets/images/projects/booki.png",
      "url": "https://cecilia-giusti.github.io/Booki/",
      "description": "Booki est une entreprise qui souhaite créer un site Internet permettant aux utilisateurs de trouver des hébergements et des activités dans la ville de leur choix. Le site devrait permettre aux utilisateurs de rechercher des hébergements et des activités en fonction de différents critères tels que le lieu, le prix, les équipements, les services offerts, etc. Le but est de fournir aux utilisateurs une plateforme facile à utiliser et pratique pour trouver des hébergements et des activités répondant à leurs besoins dans leur ville de choix.",
      "stack": ["HTML5", "CSS"],
      "specifications": "Le projet de Booki comporte plusieurs contraintes et spécifications techniques. Tout d'abord, une première étape consiste à créer un prototype en HTML et CSS non fonctionnel pour valider le design. Ce prototype doit être visuellement attractif et doit permettre de valider la charte graphique choisie pour le site. Le site devra également être responsive, c'est-à-dire qu'il devra s'adapter à différents types d'appareils, tels que les ordinateurs de bureau, les tablettes et les smartphones. Pour cela, il faudra définir des breakpoints (points de rupture) qui permettront de changer la mise en page du site en fonction de la taille de l'écran. Le site sera développé en mode 'Desktop first', c'est-à-dire que la mise en page de la version de bureau sera conçue en premier lieu, puis adaptée aux autres types d'appareils. Pour rendre le site responsive, des media queries seront utilisées pour définir des règles CSS spécifiques en fonction de la taille de l'écran. Les règles CSS devront également respecter la charte graphique définie pour le site. Pour organiser le contenu du site, le flexbox sera utilisé pour créer des mises en page flexibles et adaptatives. Les balises sémantiques seront également utilisées pour structurer le contenu du site de manière cohérente et faciliter l'accessibilité et le référencement par les moteurs de recherche. Enfin, le code HTML et CSS devra être validé en utilisant les validateurs W3C pour s'assurer que le site est conforme aux normes et standards du web. Ces spécifications et contraintes techniques sont essentielles pour s'assurer que le site est performant, facile à utiliser et accessible à tous les utilisateurs."
    },
    {
      "id": 5,
      "livrables": "https://github.com/Cecilia-Giusti/P6_Front-End-Fisheye",
      "maquettes": "./assets/images/projects/maquette-fisheye.png",
      "name": "Fisheye - Projet OC",
      "img": "./assets/images/projects/fisheye.png",
      "url": "https://cecilia-giusti.github.io/P6_Front-End-Fisheye/",
      "description": "FishEye est un nouveau client qui souhaite mettre à jour son site web. Cette plateforme permet aux photographes indépendants de présenter leurs meilleurs travaux et de les partager avec le grand public. FishEye a récemment levé des fonds et souhaite désormais mettre à jour son site web pour proposer une expérience utilisateur plus fluide, intuitive et attrayante. Le but est de permettre aux photographes de mieux présenter leur travail et d'attirer plus de visiteurs sur le site pour leur offrir une exposition plus large.",
      "stack": ["JAVASCRIPT VANILLA", "JSON", "ACCESSIBILITE"],
      "specifications": "Le projet consiste à transformer le site web de FishEye d'un site statique à un site dynamique en créant un prototype en HTML et CSS non fonctionnel pour valider le design. Le prototype doit inclure une page d'accueil listant tous les photographes avec leur nom, leur slogan, leur localisation, leur prix/heure et une image miniature de leur choix. Lorsque l'utilisateur clique sur la vignette d'un photographe, il est amené à sa page qui affiche une galerie des travaux du photographe. Les médias peuvent être triés par popularité ou par titre, et chaque média comprend un titre et un nombre de likes qui peut être incrémenté lorsque l'utilisateur clique sur l'icône 'Like'. Le site doit également être responsive, mais pour cette itération, il n'est pas nécessaire qu'il soit responsive sur mobile. L'accessibilité est également une contrainte importante, donc toutes les photos doivent comporter des descriptions textuelles et les utilisateurs doivent pouvoir utiliser les commandes du clavier pour naviguer sur le site. Le code doit également être séparé en différents fichiers (HTML, CSS, JavaScript), conforme aux standards WCAG, et utilisant une version moderne de JavaScript avec des fonctionnalités obsolètes. Enfin, le code doit être lisible avec des noms de variables et de fonctions explicites et des commentaires pour clarifier le code lorsque nécessaire."
    },
    {
      "id": 6,
      "livrables": "https://github.com/Cecilia-Giusti/Game-ON",
      "maquettes": "./assets/images/projects/maquette-gameon.png",
      "name": "GameOn - Projet OC",
      "img": "./assets/images/projects/gameon.png",
      "url": "https://cecilia-giusti.github.io/Game-ON/",
      "description": "GameOn est une entreprise spécialisée dans l'organisation de conférences et de concours de jeux. Actuellement, ils travaillent sur un nouveau projet de concours de jeux et ont besoin d'une nouvelle page d'inscription pour permettre aux joueurs de s'inscrire.",
      "stack": ["JAVASCRIPT VANILLA", "HTML", "CSS"],
      "specifications": "Le projet est en cours de développement et il reste quelques tâches à accomplir pour le finaliser. La partie Front-end de la page d'inscription doit être complétée. Pour cela, il faudra ajouter du code JavaScript manquant et assurer que le code est propre et bien documenté. Le développement de cette page d'inscription nécessite également de gérer les problèmes rencontrés sur le projet. Il est important de suivre les issues du projet pour s'assurer que toutes les fonctionnalités sont développées selon les spécifications requises. Une fois que la partie Front-end sera complétée, il sera nécessaire de tester manuellement la fonctionnalité pour s'assurer que tout fonctionne correctement. Une documentation claire et concise du code sera également requise. Pour réaliser ce projet, il sera nécessaire de forker le repository existant et d'ajouter le code manquant pour compléter la page d'inscription. Il est important que le code soit propre, facilement compréhensible et bien documenté pour faciliter sa maintenance future. En somme, le projet consiste à développer une nouvelle page d'inscription pour un concours de jeux en complétant la partie Front-end manquante à l'aide de code JavaScript proprement documenté, en gérant les problèmes rencontrés et en testant manuellement la fonctionnalité."
    }
  ],
  "socialNetwork": [
    {
      "name": "Linkedin",
      "url": "https://www.linkedin.com/in/cecilia-giusti/",
      "logo": "fa-brands fa-linkedin-in"
    },
    {
      "name": "GitHub",
      "url": "https://github.com/Cecilia-Giusti",
      "logo": "fa-brands fa-github"
    }
  ]
}
