{
  "skills": [
    "Analyse des besoins",
    "Découpage de projets",
    "Intégration du site web",
    "Tests automatisés",
    "Analyse des performances",
    "Amélioration de l’accessibilité",
    "Rigoureuse",
    "Travail en équipe"
  ],
  "projects": [
    {
      "name": "Kasa - Projet OC",
      "img": "./assets/images/projects/kasa.jpeg",
      "url": "https://cecilia-giusti.github.io/P11---Kasa/",
      "description": "Kasa est une entreprise reconnue en France pour son rôle de leader dans la location d'appartements entre particuliers. Avec son expertise et son expérience, elle offre une solution pratique et économique pour les propriétaires et les locataires en quête de logements de qualité. Kasa se distingue par son approche personnalisée et sa connaissance approfondie du marché immobilier français, ce qui lui permet de répondre efficacement aux besoins de chacun. Que vous soyez un propriétaire souhaitant louer votre bien immobilier ou un locataire cherchant un logement confortable et abordable, Kasa est la référence incontournable pour la location d'appartements entre particuliers en France.",
      "stack": ["React", "CSS"],
      "specifications": "Le projet Kasa, développé en utilisant la technologie React, devait respecter des spécifications et des contraintes strictes afin de répondre aux besoins de ses utilisateurs. Les composants React ont été soigneusement sélectionnés et intégrés pour offrir une expérience utilisateur optimale. Le React router a été utilisé pour gérer la navigation de manière fluide et efficace. De plus, les maquettes ont été suivies de manière rigoureuse pour s'assurer que l'interface graphique était cohérente et facile à utiliser.La conception de l'application a également été pensée pour être responsive, c'est-à-dire qu'elle s'adapte à tous les types d'écrans et de périphériques, afin d'offrir une expérience utilisateur optimale, peu importe le contexte. Aucune librairie externe n'a été utilisée afin de garantir une stabilité et une sécurité maximales de l'application. Le découpage par composant modulaire a été adopté pour faciliter la maintenance et l'évolutivité du code. Chaque fonctionnalité a été divisée en composants indépendants, ce qui permet de les réutiliser facilement dans d'autres parties de l'application. Enfin, une page 404 a été intégrée pour offrir une expérience utilisateur optimale, même en cas d'erreur ou de page manquante. En somme, le projet Kasa a été développé en suivant scrupuleusement toutes les spécifications et contraintes imposées pour offrir une expérience utilisateur optimale, stable et sécurisée."
    },
    {
      "name": "OhmyFood - Projet OC",
      "img": "./assets/images/projects/ohmyfood.jpg",
      "url": "https://cecilia-giusti.github.io/CeciliaGiusti_3_01_02_2022/",
      "description": "Ohmyfood, une startup établie à New York, cherche à conquérir Paris. Et pour ce faire, ils ont décidé de lancer un site mobile innovant qui permettra aux clients de découvrir les restaurants partenaires et de commander leur repas en avance. Cette idée novatrice permettra aux clients de gagner du temps en évitant les files d'attente interminables et de profiter d'un service rapide et efficace. Le site mobile sera conçu de manière à offrir une expérience utilisateur optimale. Les clients pourront facilement parcourir les différents restaurants partenaires et découvrir leur menu. Ils pourront également filtrer les options en fonction de leur goût ou de leur régime alimentaire. Une fois leur choix fait, les clients pourront passer commande en quelques clics. Le processus de commande sera simple et rapide, permettant aux clients de gagner du temps et de planifier leur repas en toute tranquillité. ",
      "stack": ["HTML", "SASS"],
      "specifications": "Les spécifications techniques de cette phase incluaient l'utilisation de Sass pour la feuille de style, une animation CSS, la prise en compte de la charte graphique pour la mise en page, un design de loading spinner, ainsi que la validation W3C pour assurer la qualité du code.En termes d'expérience utilisateur, le site devait être conçu en utilisant une approche mobile-first et être adapté pour les appareils mobiles, les tablettes et les ordinateurs. Les utilisateurs devaient pouvoir survoler les filtres pour avoir un aperçu rapide des options disponibles. Enfin, l'équipe de développement devait s'assurer que le site soit rapide et fiable pour répondre aux besoins des clients pressés. Le respect des délais de livraison et des attentes des clients était un aspect clé du projet. La phase 2 du projet Ohmyfood consistait à ajouter de nouvelles fonctionnalités, telles que la réservation en ligne et la composition de menus personnalisés. Ces nouvelles fonctionnalités devaient être développées en respectant les mêmes spécifications et contraintes que la phase 1, tout en ajoutant de nouvelles exigences techniques pour répondre aux besoins des clients."
    },
    {
      "name": "Wealth Health - Projet OC",
      "img": "./assets/images/projects/kasa.jpeg",
      "url": "https://cecilia-giusti.github.io/P-14-wealth-health/",
      "description": "Kasa est une entreprise reconnue en France pour son rôle de leader dans la location d'appartements entre particuliers. Avec son expertise et son expérience, elle offre une solution pratique et économique pour les propriétaires et les locataires en quête de logements de qualité. Kasa se distingue par son approche personnalisée et sa connaissance approfondie du marché immobilier français, ce qui lui permet de répondre efficacement aux besoins de chacun. Que vous soyez un propriétaire souhaitant louer votre bien immobilier ou un locataire cherchant un logement confortable et abordable, Kasa est la référence incontournable pour la location d'appartements entre particuliers en France.",
      "stack": ["React", "TypeScript", "SASS"],
      "specifications": "Le projet Kasa, développé en utilisant la technologie React, devait respecter des spécifications et des contraintes strictes afin de répondre aux besoins de ses utilisateurs. Les composants React ont été soigneusement sélectionnés et intégrés pour offrir une expérience utilisateur optimale. Le React router a été utilisé pour gérer la navigation de manière fluide et efficace. De plus, les maquettes ont été suivies de manière rigoureuse pour s'assurer que l'interface graphique était cohérente et facile à utiliser.La conception de l'application a également été pensée pour être responsive, c'est-à-dire qu'elle s'adapte à tous les types d'écrans et de périphériques, afin d'offrir une expérience utilisateur optimale, peu importe le contexte. Aucune librairie externe n'a été utilisée afin de garantir une stabilité et une sécurité maximales de l'application. Le découpage par composant modulaire a été adopté pour faciliter la maintenance et l'évolutivité du code. Chaque fonctionnalité a été divisée en composants indépendants, ce qui permet de les réutiliser facilement dans d'autres parties de l'application. Enfin, une page 404 a été intégrée pour offrir une expérience utilisateur optimale, même en cas d'erreur ou de page manquante. En somme, le projet Kasa a été développé en suivant scrupuleusement toutes les spécifications et contraintes imposées pour offrir une expérience utilisateur optimale, stable et sécurisée."
    }
  ]
}
